erp3l/src/Documents/ПродажаЦеннойБумаги/ПродажаЦеннойБумаги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаЦеннойБумаги</name>
  <registerRecords>AccumulationRegister.ПрочиеДоходы</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКонтрагентамиГрафики</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентами</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДоходыРасходыПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияКонтрагентДоходыРасходы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКонтрагентамиПоДокументам</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентамиПоДокументам</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщикамиПоДокументам</registerRecords>
  <registerRecords>InformationRegister.ВерсииРасчетов</registerRecords>
  <registerRecords>AccumulationRegister.БрокерскиеСчета</registerRecords>
  <registerRecords>InformationRegister.РасшифровкиГрафиковЦБ</registerRecords>
  <registerRecords>AccumulationRegister.ПартииЦенныхБумаг</registerRecords>
  <registerRecords>InformationRegister.УдалитьГрафикиРасчетов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФинансовыйИнструмент</name>
    <type>
      <types>CatalogRef.ЦенныеБумаги</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НКД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Премия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетВзаиморасчетов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРасчетов</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетОрганизации</name>
    <type>
      <types>DefinedType.БанковскийСчетОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКонтрагента</name>
    <type>
      <types>DefinedType.БанковскийСчетКонтрагента</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СчетаУчета</name>
    <attributes>
      <name>ВидСчетаФИ</name>
      <type>
        <types>CatalogRef.ВидыСчетовФИ</types>
      </type>
    </attributes>
    <attributes>
      <name>Счет</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыОпераций</name>
    <attributes>
      <name>ОперацияГрафика</name>
      <type>
        <types>CatalogRef.ОперацииГрафиковДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяБюджета</name>
      <type>
        <types>Characteristic.ВидыБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика4</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика5</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика6</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l/src/Catalogs/ОперацииГрафиковДоговоров/ОперацииГрафиковДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОперацииГрафиковДоговоров</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>АккредитивВыданный</name>
      <description>Аккредитив выданный</description>
    </items>
    <items>
      <name>ЛизингПолученный</name>
      <description>Аренда, лизинг</description>
    </items>
    <items>
      <name>ГарантияВыданная</name>
      <description>Банковская гарантия выданная</description>
    </items>
    <items>
      <name>ВалютноПроцентныйСвоп</name>
      <description>Валютно-процентный своп</description>
    </items>
    <items>
      <name>ВалютныйСвоп</name>
      <description>Валютный своп</description>
    </items>
    <items>
      <name>ВалютныйФорвард</name>
      <description>Валютный форвард</description>
    </items>
    <items>
      <name>ВексельВыданный</name>
      <description>Вексель выданный</description>
    </items>
    <items>
      <name>ВексельПолученный</name>
      <description>Вексель полученный</description>
    </items>
    <items>
      <name>Депозит</name>
      <description>Депозит</description>
    </items>
    <items>
      <name>ДоходныйКоммерческийДоговор</name>
      <description>Доходный коммерческий договор</description>
    </items>
    <items>
      <name>ЗаемВыданный</name>
      <description>Заем выданный</description>
    </items>
    <items>
      <name>ЗаемПолученный</name>
      <description>Заем полученный</description>
    </items>
    <items>
      <name>КредитПолученный</name>
      <description>Кредит полученный</description>
    </items>
    <items>
      <name>МНО</name>
      <description>Минимальный неснижаемый остаток</description>
    </items>
    <items>
      <name>ОблигацияВыпущенная</name>
      <description>Облигация выпущенная</description>
    </items>
    <items>
      <name>ОблигацияКупленная</name>
      <description>Облигация купленная</description>
    </items>
    <items>
      <name>Овердрафт</name>
      <description>Овердрафт</description>
    </items>
    <items>
      <name>РасходныйКоммерческийДоговор</name>
      <description>Расходный коммерческий договор</description>
    </items>
  </predefined>
  <attributes>
    <name>ЭлементСтруктурыЗадолженности</name>
    <type>
      <types>EnumRef.ЭлементыСтруктурыЗадолженности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидФинансовогоИнструмента</name>
    <type>
      <types>EnumRef.ВидыФинансовыхИнструментов</types>
    </type>
  </attributes>
  <attributes>
    <name>КолонкаСекции</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДвижения</name>
    <comment>В зависимости от вида бюджета, либо доход/расход, либо поступление/платеж</comment>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеВзаиморасчетов</name>
    <comment>Приход - дебиторская задолженность, расход - кредиторская</comment>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперацииУХ</name>
    <type>
      <types>CatalogRef.ВидыОперацийУХ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </attributes>
</mdclass:Catalog>

erp3l/src/Documents/ПродажаЦеннойБумаги/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
 Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ИнициализироватьФормуНаСервере();
	КонецЕсли;

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ИнициализироватьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	ЗаполнитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыйИнструментПриИзменении(Элемент)	
	ФинансовыйИнструментПриИзмененииНаСервере();	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьПриИзменении(Элемент)
	ЗаполнитьДокумент(Новый Структура("ЗаполнитьКэшируемыеЗначения,РассчитатьСтоимостьНоминала,РассчитатьПремию"));
КонецПроцедуры

&НаКлиенте
Процедура НКДПриИзменении(Элемент)
	ЗаполнитьДокумент(Новый Структура("ЗаполнитьКэшируемыеЗначения,РассчитатьСтоимостьНоминала,РассчитатьПремию,РассчитатьСтоимость"));
КонецПроцедуры

&НаКлиенте
Процедура ПремияПриИзменении(Элемент)
	ЗаполнитьДокумент(Новый Структура("ЗаполнитьКэшируемыеЗначения,РассчитатьСтоимостьНоминала,РассчитатьСтоимость"));
КонецПроцедуры

&НаКлиенте
Процедура СчетаУчета(Команда)
	ФинансовыеИнструментыФормыКлиент.ОткрытьФормуВыбораСчетов(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ВспомогательныеПроцедурыФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
		
	ЭтоОблигация = (Форма.ВидФинансовогоИнструмента = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхИнструментов.Облигация"));

	Элементы.ФинансовыйИнструментЦенаВыпуска.Видимость = Форма.ДисконтнаяЦБ;
	
	Элементы.Контрагент.Заголовок = ?(Форма.ЭтоБиржевойРынок, Нстр("ru = 'Брокер'"), Нстр("ru = 'Контрагент'"));
	Элементы.Договор.Заголовок = ?(Форма.ЭтоБиржевойРынок, Нстр("ru = 'Договор брокерского обслуживания'"), Нстр("ru = 'Договор контрагента'"));
	
	Элементы.НКД.Видимость = ЭтоОблигация;
	Элементы.Премия.Видимость = ЭтоОблигация;
	
	ФинансовыеИнструментыФормыКлиентСервер.УправлениеФормой_СчетаУчета(Форма);
	ФинансовыеИнструментыФормыКлиентСервер.УправлениеФормойБюджетирование(Форма);
	
КонецПроцедуры

&НаСервере
Процедура ФинансовыйИнструментПриИзмененииНаСервере()

	ОперацииСЦеннымиБумагамиФормы.УстановитьПараметрыЦеннойБумаги(ЭтотОбъект);
	ЗаполнитьДокументНаСервере();
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьФормуНаСервере()
	
	ОперацииСЦеннымиБумагамиФормы.УстановитьПараметрыЦеннойБумаги(ЭтотОбъект);
	ФинансовыеИнструментыФормы.ПриСозданииНаСервере_СчетаУчета(ЭтотОбъект);
	ЗаполнитьДокументНаСервере(Новый Структура("ЗаполнитьКэшируемыеЗначения,РассчитатьСтоимостьНоминала"));
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокумент(СтруктураДействий = Неопределено)
		
	Если Объект.ФинансовыйИнструмент.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДокументНаСервере(СтруктураДействий);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументНаСервере(СтруктураДействий = Неопределено)
	
	Если СтруктураДействий = Неопределено Тогда
		СтруктураДействий = Новый Структура("ЗаполнитьКэшируемыеЗначения,ЗаполнитьНКД,РассчитатьСтоимостьНоминала,РассчитатьПремию,РассчитатьСтоимость");	
	КонецЕсли;
	
	ЭтаФорма.КэшируемыеЗначения.Вставить("КонтекстДокумента", Новый Структура("Дата", Объект.Дата));	
	ФинансовыеИнструментыФормыВызовСервера.ОбработатьСтрокуЦБ(Объект, СтруктураДействий, ЭтаФорма.КэшируемыеЗначения);
	
	ЭтаФорма.КэшируемыеЗначения.Свойство("СтоимостьНоминала", СтоимостьНоминала);
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ФинансовыеИнструментыФормыКлиентСервер.ЗаполнитьСчетВзаиморасчетов(ЭтаФорма);	
КонецПроцедуры

#КонецОбласти

#Область ПараметрыОперацийГрафика
&НаКлиенте
Процедура НастроитьПараметрыОпераций(Команда)
	
	ПараметрыКоманды = ДанныеОткрытияПараметровОперацийГрафика();			
	ДоговорыКонтрагентовФормыУХКлиент.ОткрытьПараметрыОперацийГрафика(ЭтотОбъект, ПараметрыКоманды);	
	
КонецПроцедуры

&НаСервере
Функция ДанныеОткрытияПараметровОперацийГрафика()	
	
	НастройкиОпераций = Объект.ПараметрыОпераций.Выгрузить();
	АдресНастроек = ПоместитьВоВременноеХранилище(НастройкиОпераций, ЭтотОбъект.УникальныйИдентификатор);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("АдресНастроек", АдресНастроек);
	ПараметрыОткрытия.Вставить("ГруппаОперацийГрафика", ГруппаОперацийГрафика());
	ПараметрыОткрытия.Вставить("ТолькоПросмотр", Ложь);
	
	Возврат ПараметрыОткрытия;
	
КонецФункции

&НаСервере
Функция ГруппаОперацийГрафика()
	
	Возврат Справочники.ОперацииГрафиковДоговоров.ОблигацияКупленная;

КонецФункции	

&НаКлиенте
Процедура ЗавершитьНастройкуОпераций(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Строка") Тогда
		ЗагрузитьНастройкиОпераций(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиОпераций(Адрес)	
	
	ТаблицаНастроек = ПолучитьИзВременногоХранилища(Адрес);
	Объект.ПараметрыОпераций.Загрузить(ТаблицаНастроек);
	ЭтотОбъект.Модифицированность = Истина;
	
КонецПроцедуры
#КонецОбласти
